tests/payment.yml

Payment:
	payment1:
		Gateway: Manual
		MoneyAmount: 20.23
		MoneyCurrency: NZD
		Status: Created
	payment2:
		Gateway: PaymentExpress_PxPay
		MoneyAmount: 1234.56
		MoneyCurrency: USD
		Status: Authorized
	payment3:
		Gateway: PaymentExpress_PxPay
		MoneyAmount: 769.50
		MoneyCurrency: AUD
		Status: Captured
	payment4:
		Gateway: UknownGateway
		MoneyAmount: 2.50
		MoneyCurrency: NZD
		Status: Captured

GatewayMessage:
	transaction1:
		ClassName: GatewayRequestMessage
		Type: Purchase
		Identifier: UNIQUEHASH23q5123tqasdf
		Reference: 
		Message: 
		Code:
		PaymentID: =>Payment.payment2